In [1]:
# 모듈로딩
import pandas as pd

In [2]:
PATH = '../DATA/'
someList = ['survey_person.csv', 'survey_site.csv','survey_survey.csv' , 'survey_visited.csv']
count = 0
df = []
for i in someList:
    df.append(pd.read_csv(PATH + i))

df[0]

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

# 중복 데이터 처리

- 중복 여부 체크: 객체.duplicated()
    - 파라미터: keep, subset

- 중복 제거: 객체.drop_duplicates()
- 
- keep = 'first' : 디폴트

In [13]:
df = pd.DataFrame([[1,2,3], [1,2,1], [1,2,3]], columns= ['a','b','c'])
df

   a  b  c
0  1  2  3
1  1  2  1
2  1  2  3

In [14]:
# 중복 데이터(행 row) 체크 -> duplicated() -> 기본값 keep = 'first' (중복 레코드의 첫번째 꺼만 남기기)
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [15]:
df.duplicated(keep='last')   # 중복 레코드의 마지막 꺼만 남기기

0     True
1    False
2    False
dtype: bool

In [16]:
df.duplicated(keep=False)   # 중복 레코드는 모두 True로 표시

0     True
1    False
2     True
dtype: bool

In [22]:
# 특정 컬럼의 동일여부 설정 -> subset = [컬럼명]
df.duplicated(subset= 'b')

0    False
1     True
2     True
dtype: bool

In [21]:
df.duplicated(subset= ['b','c'])

0    False
1    False
2     True
dtype: bool

In [23]:
# 중복 제거하기 -> drop_duplicates(subset, keep)
df.drop_duplicates()

   a  b  c
0  1  2  3
1  1  2  1

In [25]:
df.drop_duplicates(keep='last')

   a  b  c
1  1  2  1
2  1  2  3

In [26]:
df.drop_duplicates(subset='b')

   a  b  c
0  1  2  3